//==========================================================================
//文件名称：pit.h
//功能概要：KL25 pit底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版本更新：2013-5-5  V2.0
//==========================================================================


#ifndef _PIT_H
#define _PIT_H
//1 头文件
#include "common.h"
#define PIT_IRQ_NO 22


//2 宏定义
#define PIT0 0
#define PIT1 1
//==========================================================================
//函数名称: pit_init
//函数返回: 无
//参数说明: pitno:表示pit通道号，0,1。
//          int_us:表示定时器运行的周期单位微秒.一般取5ms.即5000
//功能概要: 设置相关寄存器的值
//==========================================================================
void pit_init(uint_8 pitno,uint_32 int_us);
//==========================================================================
//函数名称: enable_pit_int
//函数返回: 无
//参数说明: 无
//功能概要: 开PIT中断
//==========================================================================
void enable_pit_int();
//==========================================================================
//函数名称: disable_pit_int
//函数返回: 无
//参数说明: 无
//功能概要: 关闭PIT中断
//==========================================================================
void disable_pit_int();


#endif

//===========================================================================
//声明：
//（1）我们开发的源代码，在本中心提供的硬件系统测试通过，真诚奉献给社会，不足之处，
//     欢迎指正。
//（2）对于使用非本中心硬件系统的用户，移植代码时，请仔细根据自己的硬件匹配。
//
//苏州大学飞思卡尔嵌入式中心（苏州华祥信息科技有限公司）
//技术咨询：0512-65214835  http://sumcu.suda.edu.cn
//业务咨询：0512-87661670,18915522016  http://www.hxtek.com.cn
